[Killed] BlockStatement
app.js:18:14
 var app = express();
 
 //async IIFE
-(async () => {
-  await sequelize.sync();
-  try {
-    await sequelize.authenticate();
-    console.log("Connection to DB Worked!");
-  } catch (error){
-    console.log("Connection to DB Failed...", error);
-  }
-})();
+(async () => {})();
 // view engine setup
 app.set('views', path.join(__dirname, 'views'));
killedBy: Comprehensive Mutation Killing Suite - V13.4 Final Precision Strikes for survivors should kill Op.or ObjectLiteral where: {} in index.js
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "The Search Returned No Results"

[Killed] BlockStatement
app.js:20:7
 //async IIFE
 (async () => {
   await sequelize.sync();
-  try {
-    await sequelize.authenticate();
-    console.log("Connection to DB Worked!");
-  } catch (error){
+  try {} catch (error){
     console.log("Connection to DB Failed...", error);
   }
killedBy: Comprehensive Mutation Killing Suite - V13.4 Search Logic & Logical Operators should kill every specific field in Op.or (Title, Author, Genre, Year)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "KILL_A"

[NoCoverage] BlockStatement
app.js:23:18
   try {
     await sequelize.authenticate();
     console.log("Connection to DB Worked!");
-  } catch (error){
-    console.log("Connection to DB Failed...", error);
-  }
+  } catch (error){}
 })();
 // view engine setup

[NoCoverage] StringLiteral
app.js:24:17
     await sequelize.authenticate();
     console.log("Connection to DB Worked!");
   } catch (error){
-    console.log("Connection to DB Failed...", error);
+    console.log("", error);
   }
 })();

[Killed] StringLiteral
app.js:28:39
   }
 })();
 // view engine setup
-app.set('views', path.join(__dirname, 'views'));
+app.set('views', path.join(__dirname, ""));
 app.set('view engine', 'pug');
 
killedBy: Comprehensive Mutation Killing Suite - V13.4 Root & Basic Navigation should kill view engine and static path mutants
statusReason: SequelizeDatabaseError: SQLITE_ERROR: no such table: Books

[Killed] StringLiteral
app.js:29:24
 })();
 // view engine setup
 app.set('views', path.join(__dirname, 'views'));
-app.set('view engine', 'pug');
+app.set('view engine', "");
 
 app.use(logger('dev'));
killedBy: Comprehensive Mutation Killing Suite - V13.4 Root & Basic Navigation should kill view engine and static path mutants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "pug"
Received: ""

[Killed] ObjectLiteral
app.js:33:28
 
 app.use(logger('dev'));
 app.use(express.json());
-app.use(express.urlencoded({ extended: false }));
+app.use(express.urlencoded({}));
 app.use(cookieParser());
 app.use(express.static(path.join(__dirname, 'public')));
killedBy: Comprehensive Mutation Killing Suite - V13.4 Search Logic & Logical Operators should kill every specific field in Op.or (Title, Author, Genre, Year)
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "KILL_A"
