[Timeout] BlockStatement
errorHandlers.js:5:40
 
 
 //404 handler
-const fourOhFour = (req, res, next) => {
-    const err = new Error();
-    err.status = 404;
-    err.message = "A 404 Error Occured!  The webpage could not be found!";
-    next(err);
-}
+const fourOhFour = (req, res, next) => {}
 
 //Global Error Handler

[Killed] StringLiteral
errorHandlers.js:8:19
 const fourOhFour = (req, res, next) => {
     const err = new Error();
     err.status = 404;
-    err.message = "A 404 Error Occured!  The webpage could not be found!";
+    err.message = "";
     next(err);
 }
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill 404 handler message and survivors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "webpage could not be found!"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1>404 Error!  Page Not Found!  </h1><p></p><br><br><a class=\"button\" href=\"/\">Back to the \"Books\" Page</a></body></html>"

[Timeout] BlockStatement
errorHandlers.js:13:46
 }
 
 //Global Error Handler
-const globalError = (err, req, res, next) => {
-    if (err.status === 404) {
-        res.render('page-not-found', {err, title: "404.  Page Not Found"});  
-    } else {
-        err.status = err.status || 500;
-        err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
-        console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
-        res.render('error', {err});
-        return err;
-    }
-}
+const globalError = (err, req, res, next) => {}
 
 module.exports = {fourOhFour, globalError};

[Killed] ConditionalExpression
errorHandlers.js:14:9
 
 //Global Error Handler
 const globalError = (err, req, res, next) => {
-    if (err.status === 404) {
+    if (true) {
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill global error log strings and server error prefix
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error Status: 500", StringContaining "CRITICAL_FAIL"

Number of calls: 0

[Killed] ConditionalExpression
errorHandlers.js:14:9
 
 //Global Error Handler
 const globalError = (err, req, res, next) => {
-    if (err.status === 404) {
+    if (false) {
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill 404 handler message and survivors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "404 Error!"

[Killed] StringLiteral
errorHandlers.js:15:20
 //Global Error Handler
 const globalError = (err, req, res, next) => {
     if (err.status === 404) {
-        res.render('page-not-found', {err, title: "404.  Page Not Found"});  
+        res.render("", {err, title: "404.  Page Not Found"});  
     } else {
         err.status = err.status || 500;
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill 404 handler message and survivors
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "404 Error!"
Received string:    "<!DOCTYPE html>
<html lang=\"en\">
<head>
<meta charset=\"utf-8\">
<title>Error</title>

[Timeout] BlockStatement
errorHandlers.js:16:12
 const globalError = (err, req, res, next) => {
     if (err.status === 404) {
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
-    } else {
-        err.status = err.status || 500;
-        err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
-        console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
-        res.render('error', {err});
-        return err;
-    }
+    } else {}
 }
 

[Killed] ConditionalExpression
errorHandlers.js:17:22
     if (err.status === 404) {
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
-        err.status = err.status || 500;
+        err.status = false;
         err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
         console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill global error log strings and server error prefix
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error Status: 500", StringContaining "CRITICAL_FAIL"
Received: "Error Status: false", "Error Message: A Server Error Occured! CRITICAL_FAIL"

Number of calls: 1

[Killed] ConditionalExpression
errorHandlers.js:17:22
     if (err.status === 404) {
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
-        err.status = err.status || 500;
+        err.status = true;
         err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
         console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill global error log strings and server error prefix
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error Status: 500", StringContaining "CRITICAL_FAIL"
Received: "Error Status: true", "Error Message: A Server Error Occured! CRITICAL_FAIL"

Number of calls: 1

[Killed] ConditionalExpression
errorHandlers.js:18:23
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
         err.status = err.status || 500;
-        err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
+        err.message = false;
         console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
         res.render('error', {err});
killedBy: Comprehensive Mutation Killing Suite - V13.4 Create Book & Validation should cover generic error catch in POST /books/new
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "POST_NEW_FAIL"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>false</h2><pre>Error:·

[Killed] LogicalOperator
errorHandlers.js:18:23
         res.render('page-not-found', {err, title: "404.  Page Not Found"});  
     } else {
         err.status = err.status || 500;
-        err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
+        err.message = `A Server Error Occured! ${err.message}` && "A Server Error Occurred!";
         console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
         res.render('error', {err});
killedBy: Comprehensive Mutation Killing Suite - V13.4 Create Book & Validation should cover generic error catch in POST /books/new
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "POST_NEW_FAIL"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occurred!</h2><pre>Error: A Server Error Occurred!

[Killed] StringLiteral
errorHandlers.js:19:21
     } else {
         err.status = err.status || 500;
         err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
-        console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
+        console.log(``, `Error Message: ${err.message}`);      
         res.render('error', {err});
         return err;
killedBy: Comprehensive Mutation Killing Suite - V13.4 Global Error & App Logic Precision Strikes should kill global error log strings and server error prefix
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error Status: 500", StringContaining "CRITICAL_FAIL"
Received: "", "Error Message: A Server Error Occured! CRITICAL_FAIL"

Number of calls: 1

[Killed] ObjectLiteral
errorHandlers.js:20:29
         err.status = err.status || 500;
         err.message = `A Server Error Occured! ${err.message}` || "A Server Error Occurred!";
         console.log(`Error Status: ${err.status}`, `Error Message: ${err.message}`);      
-        res.render('error', {err});
+        res.render('error', {});
         return err;
     }
killedBy: Comprehensive Mutation Killing Suite - V13.4 Create Book & Validation should cover generic error catch in POST /books/new
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "POST_NEW_FAIL"
Received string:    "<!DOCTYPE html>
<html lang=\"en\">
<head>
<meta charset=\"utf-8\">
<title>Error</title>
