[Killed] ConditionalExpression
routes/index.js:102:8
     book = await Book.create(req.body);
     res.redirect("/books");
   } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
+    if(false) {
       const errors = error.errors.map(err => err.message)
       res.render('new-book', {errors, book, title: "New Book"});
killedBy: Comprehensive Mutation Killing Suite - V13.4 Create Book & Validation should kill SequelizeValidationError map and title mutants in POST /books/new
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "New Book"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! Validation error: Please Provide a Value For Title,
Validation error: Please Provide a Value For Author</h2><pre>SequelizeValidationError: A Server Error Occu
